""" Файл, который содержит описание класса для игры Begals
"""


class BitMap:
    """ Основной класс для выполнения задачи
    
        Введенное предложение от пользователя будет подставляться на
        географическую карту и выводиться на экран
    """
    
    def _get_input_str(self) -> str:
        """ Метод запрашивает у пользователя строку, которую необходимо подставить
            в битовую карту

        Returns:
            str: Введенную строку от пользователя для замены в битовой карте
        """
        return input('Введите строку, которую хотите увидеть на битовой карте: ')
    
    def _get_bitmap_with_input_str(self, input_str: str) -> str:
        """ Метод позволяет получить битовую карту с замененной строкой,
            которую ввел пользователь

        Args:
            input_str (str): Строка, которую необходимо вставить в битовую карту

        Returns:
            str: Полученная битовая карта
        """
        output = ''
        for ind_bitmap in range(len(self._bitmap)):
            if self._bitmap[ind_bitmap] in self._skip_symbols:
                output += self._bitmap[ind_bitmap]
            else:
                output += input_str[ind_bitmap % len(input_str)]
        return output
    
    def __init__(self) -> None:
        self._skip_symbols = [' ', '\n']
        self._bitmap = """....................................................................
   **************   *  *** **  *      ******************************
  ********************* ** ** *  * ****************************** *
 **      *****************       ******************************
          *************          **  * **** ** ************** *
           *********            *******   **************** * *
            ********           ***************************  *
   *        * **** ***         *************** ******  ** *
               ****  *         ***************   *** ***  *
                 ******         *************    **   **  *
                 ********        *************    *  ** ***
                   ********         ********          * *** ****
                   *********         ******  *        **** ** * **
                   *********         ****** * *           *** *   *
                     ******          ***** **             *****   *
                     *****            **** *            ********
                    *****             ****              *********
                    ****              **                 *******   *
                    ***                                       *    *
                    **     *                    *
....................................................................
        """
    
    def start(self) -> None:
        """ Метод запуска программы
        """
        input_str = self._get_input_str()
        print(self._get_bitmap_with_input_str(input_str))
        