""" Файл описывает класс с настройками для CLI игры BLackJack
"""


class CLISettings:
    """ Класс с настройками для CLI игры BLackJack
    """
    # Текст для запроса данных у пользователя
    INPUT_TEXT_FOR_GET_LANGUAGE = 'Выберите один из доступных языков (Например: "ru"): '
    
    INPUT_TEXT_FOR_HACK_DECODING = 'Введите текст, который хотите взломать: '
    
    # Текст, который будет выводится перед результатом
    PRINT_TEXT_RESULT = 'Текста, которые получились в результате взлома'
    
